Delete a middle bend in a bank is not allowed
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DeleteMiddleBendNotAllowed { get; }
  Visual Basic
Public Shared ReadOnly Property DeleteMiddleBendNotAllowed As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DeleteMiddleBendNotAllowed {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures BendFailures Class
  Autodesk.Revit.DB Namespace